app/views/shops/show.html.erb


  <% if @shop.shop_comments.present? %>
---
SELECT "shop_comments".* FROM "shop_comments" WHERE "shop_comments"."shop_id" = $1  [["shop_id", 6]]


  <% if @shop.drinks.present? %>
---
SELECT "drinks".* FROM "drinks" WHERE "drinks"."shop_id" = $1  [["shop_id", 4]]