app/controllers/shop_comments_controller.rb

  def show
    @shop_comment = ShopComment.find(params[:id])
---
SELECT  "shop_comments".* FROM "shop_comments" WHERE "shop_comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @shop = Shop.find(params[:shop_id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def edit
    @shop = Shop.find(params[:shop_id])
    @shop_comment = ShopComment.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "shop_comments".* FROM "shop_comments" WHERE "shop_comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @shop = Shop.find(params[:shop_id])
    @shop_comment = @shop.shop_comments.create(shop_comment_params)
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "shop_comments" ("heading", "body", "shop_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["heading", "It was Great"], ["body", "Lovely place to chillax and drink coffee."], ["shop_id", 6], ["created_at", 2016-08-04 13:14:17 UTC], ["updated_at", 2016-08-04 13:14:17 UTC]]

  def update
    @shop = Shop.find(params[:shop_id])
    @shop_comment = ShopComment.find(params[:id])

    if @shop_comment.update(shop_comment_params)
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "shop_comments".* FROM "shop_comments" WHERE "shop_comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "shop_comments" SET "body" = $1, "updated_at" = $2 WHERE "shop_comments"."id" = $3  [["body", "And oh-so delish!"], ["updated_at", 2016-08-04 21:17:56 UTC], ["id", 1]]

  def destroy
    @shop_comment = ShopComment.find(params[:id])
    @shop_comment.destroy
---
SELECT  "shop_comments".* FROM "shop_comments" WHERE "shop_comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "shop_comments" WHERE "shop_comments"."id" = $1  [["id", 1]]