app/controllers/shops_controller.rb

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @shop = Shop.find(params[:id])

INSERT INTO "shops" ("name", "shop_type", "created_at", "updated_at", "img_url", "address") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Coffee JAms"], ["shop_type", "Hipster"], ["created_at", 2016-08-04 20:50:47 UTC], ["updated_at", 2016-08-04 20:50:47 UTC], ["img_url", ""], ["address", "1900 6th St NW"]]
---
  def create
    @shop = Shop.new(shop_params)

    if @shop.save

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "shops" SET "shop_type" = $1, "updated_at" = $2 WHERE "shops"."id" = $3  [["shop_type", "Chain"], ["updated_at", 2016-08-02 12:17:57 UTC], ["id", 1]]
---
  def update
    @shop = Shop.find(params[:id])

    if @shop.update(shop_params)

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "shops" WHERE "shops"."id" = $1  [["id", 3]]
---
  def destroy
    @shop = Shop.find(params[:id])
    @shop.destroy